thermalSimulations/simpleCarSolarPanel/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet
    {
        type  fixedValue;
        value $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }


    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    upperWall
    {
        type slip;
    }

    frontAndBack
    {
        type slip;
    }
}


// ************************************************************************* //
