thermalSimulations/simpleCarSolarPanel/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.24;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    //- Define inlet conditions
    inlet
    {
        type  fixedValue;
        value $internalField;
    }

    outlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    motorBikeGroup
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    upperWall
    {
        type slip;
    }

    frontAndBack
    {
        type slip;
    }
}


// ************************************************************************* //
